{
  "version": "1.0.0",
  "lastUpdated": "2025-01-22",
  "title": "EAP Facilitator Development Program",
  "description": "A comprehensive development program for effective facilitation skills",
  "sections": [
    {
      "id": "orientation",
      "title": "Program Orientation",
      "color": "#cdb483",
      "description": "Introduction to the program structure, expectations, and foundational concepts",
      "lessons": [
        {
          "id": "syllabus-overview",
          "title": "Syllabus Overview",
          "order": 1,
          "summary": "How the course flows; expectations; completion requirements and assessment criteria.",
          "whyItMatters": "Understanding the program structure ensures you maximize your learning journey and meet all development milestones.",
          "strategies": [
            "Read through the complete program overview carefully",
            "Review the competency framework and self-assessment tools",
            "Set personal learning goals aligned with program outcomes",
            "Understand the portfolio development process"
          ],
          "resources": [
            {
              "label": "Program Syllabus (PDF)",
              "href": "/resources/EAPFacilitatorSyllabus.pdf",
              "type": "pdf",
              "category": "Reference Handouts/One-Pagers"
            },
            {
              "label": "Competency Framework Guide",
              "href": "/resources/CompetencyFrameworkGuide.pdf", 
              "type": "pdf",
              "category": "Reference Handouts/One-Pagers"
            }
          ]
        }
      ]
    },
    {
      "id": "leadership",
      "title": "Leadership",
      "color": "#467edd", 
      "description": "Developing leadership skills for effective facilitation and team management",
      "moduleIntroduction": {
        "summary": "Leadership in the Elevate Adolescence Program is not about holding authority—it's about setting the tone, modeling integrity, and guiding with responsiveness. As a facilitator, your leadership shapes how safe, engaged, and empowered participants feel in your group.\n\nThis module will help you strengthen three key leadership skills:\n\n• Providing Feedback that encourages growth instead of correction alone.\n• Fostering Independence by giving participants space to make choices, practice autonomy, and discover their own strengths.\n• Decision Making so you can calmly adjust when plans shift, energy changes, or challenges arise.\n\nStrong leadership is both structured and soft. It means creating consistency and boundaries while also allowing flexibility and care. Through this module, you will practice leading in real time—whether it's guiding discussions, supporting youth through challenges, or stepping back to let them take the lead.\n\nThe goal is not perfection, but presence: showing up with clarity, courage, and compassion so participants feel seen, supported, and inspired to rise.",
        "learningObjectives": [
          "Learn to deliver constructive and timely feedback that encourages growth and development",
          "Cultivate strategies to empower adolescents to take initiative and make informed decisions",
          "Develop the ability to make swift, effective decisions that keep sessions on track and responsive to participants' needs"
        ],
        "lessonOutline": "This module follows the Build→Practice→Strengthen progression across three key skills: Providing Feedback, Fostering Independence, and Decision Making."
      },
      "lessons": [
        {
          "id": "build-feedback",
          "title": "Build: Providing Feedback",
          "order": 1,
          "summary": "Understand the principles of constructive feedback and its role in adolescent development.",
          "whyItMatters": "Effective feedback drives growth, builds trust, and creates psychological safety in learning environments.",
          "strategies": [
            "Use the SBI (Situation-Behavior-Impact) feedback model",
            "Practice the Feedback Planning Tool for difficult conversations",
            "Focus on specific behaviors rather than personality traits",
            "Invite reflection and dialogue rather than one-way delivery",
            "Balance developmental feedback with recognition"
          ],
          "resources": []
        },
        {
          "id": "practice-feedback",
          "title": "Practice: Providing Feedback",
          "order": 2,
          "summary": "Deliver feedback in simulated sessions, focusing on clarity and encouragement.",
          "whyItMatters": "Practice builds confidence and competence in delivering feedback that promotes growth rather than defensiveness.",
          "strategies": [
            "Practice giving both corrective and affirming feedback",
            "Learn to time feedback appropriately for maximum impact",
            "Develop skills for delivering feedback to diverse learning styles",
            "Practice creating action steps that participants can implement",
            "Learn to follow up on feedback to support sustained change"
          ],
          "resources": []
        },
        {
          "id": "strengthen-feedback", 
          "title": "Strengthen: Providing Feedback",
          "order": 3,
          "summary": "Adapt feedback techniques to individual needs, fostering a growth-oriented environment.",
          "whyItMatters": "Advanced feedback skills enable facilitators to support diverse learners and maintain psychological safety even during challenging conversations.",
          "strategies": [
            "Customize feedback approach based on individual participant needs",
            "Navigate resistance to feedback with empathy and skill",
            "Create feedback loops that promote ongoing self-reflection",
            "Balance individual feedback with group learning opportunities",
            "Model receiving feedback to create a culture of growth"
          ],
          "resources": [
            {
              "label": "Types of Feedback",
              "href": "/resources/typesoffeedback.pdf",
              "type": "pdf",
              "category": "Reference Handouts/One-Pagers"
            },
            {
              "label": "Feedback Planning Tool",
              "href": "/resources/feedbackplanningtool.pdf",
              "type": "pdf",
              "category": "Planning Tools"
            }
          ]
        },
        {
          "id": "build-independence",
          "title": "Build: Fostering Independence",
          "order": 4,
          "summary": "Learn strategies to encourage autonomy and decision-making in adolescents.",
          "whyItMatters": "Fostering independence builds self-efficacy and prepares participants for successful adulthood.",
          "strategies": [
            "Understand the balance between support and independence",
            "Learn to ask questions that promote self-reflection",
            "Practice stepping back to allow natural learning opportunities",
            "Develop skills for scaffolding decision-making processes",
            "Create opportunities for participants to lead and teach others"
          ],
          "resources": []
        },
        {
          "id": "practice-independence",
          "title": "Practice: Fostering Independence",
          "order": 5,
          "summary": "Implement techniques that promote self-initiative during role-play scenarios.",
          "whyItMatters": "Practice helps facilitators learn when to step in and when to step back for optimal learning.",
          "strategies": [
            "Practice using open-ended questions to guide without directing",
            "Learn to resist the urge to rescue participants from productive struggle",
            "Develop skills for celebrating self-directed learning achievements",
            "Practice creating choice points within structured activities",
            "Learn to facilitate peer-to-peer learning and support"
          ],
          "resources": []
        },
        {
          "id": "strengthen-independence",
          "title": "Strengthen: Fostering Independence", 
          "order": 6,
          "summary": "Support participants in setting and achieving personal goals, reinforcing their independence.",
          "whyItMatters": "Advanced independence fostering creates lasting change and builds participant capacity for self-direction.",
          "strategies": [
            "Master the art of goal-setting conversations that inspire action",
            "Learn to support participants through setbacks without rescuing",
            "Develop skills for helping participants build their own support systems",
            "Practice celebrating growth and progress in meaningful ways",
            "Create systems for participants to mentor and support each other"
          ],
          "resources": [
            {
              "label": "Encouraging Autonomy",
              "href": "/resources/encouragingautonomy.pdf",
              "type": "pdf",
              "category": "Facilitator Tips"
            },
            {
              "label": "Scaffolding in Action",
              "href": "/resources/scaffolding.pdf",
              "type": "pdf",
              "category": "Scenarios in Action"
            }
          ]
        },
        {
          "id": "build-decision-making",
          "title": "Build: Decision Making",
          "order": 7,
          "summary": "Recognize common challenges that require immediate decisions during facilitation.",
          "whyItMatters": "Real-time decision-making keeps sessions responsive and participants engaged.",
          "strategies": [
            "Learn to read group energy and individual needs quickly",
            "Understand common facilitation dilemmas and decision points",
            "Practice staying calm under pressure while making decisions",
            "Develop a toolkit of go-to strategies for common situations",
            "Learn to balance planning with responsive flexibility"
          ],
          "resources": []
        },
        {
          "id": "practice-decision-making",
          "title": "Practice: Decision Making",
          "order": 8,
          "summary": "Engage in exercises that simulate real-time decision-making under pressure.",
          "whyItMatters": "Simulated practice builds confidence and competence for real-world facilitation challenges.",
          "strategies": [
            "Practice making quick decisions with incomplete information",
            "Learn to communicate decisions clearly and confidently to the group",
            "Develop skills for adjusting course when initial decisions aren't working",
            "Practice managing multiple group needs simultaneously",
            "Learn to involve participants appropriately in group decisions"
          ],
          "resources": []
        },
        {
          "id": "strengthen-decision-making",
          "title": "Strengthen: Decision Making",
          "order": 9,
          "summary": "Develop the ability to make swift, effective decisions that keep sessions responsive to participants' needs.",
          "whyItMatters": "Masterful decision-making creates smooth, responsive sessions that feel effortless to participants.",
          "strategies": [
            "Develop intuitive decision-making skills based on group dynamics",
            "Learn to make decisions that serve both individual and group needs",
            "Master the ability to pivot quickly while maintaining group trust",
            "Practice transparent decision-making that models good judgment",
            "Develop systems for learning from decisions to improve future choices"
          ],
          "resources": [
            {
              "label": "Decision Anchor Sheet",
              "href": "/resources/decisionanchorsheet.pdf",
              "type": "pdf",
              "category": "Planning Tools"
            }
          ]
        }
      ]
    },
    {
      "id": "communication",
      "title": "Communication",
      "color": "#b1b4e5",
      "description": "Advanced communication skills for facilitating meaningful dialogue and connection",
      "moduleIntroduction": {
        "summary": "Facilitators serve as role models in both verbal and non-verbal communication. Within EAP spaces, communication is more than delivering content—it's how we show consistency, clarity, and care. This competency captures a facilitator's ability to express ideas clearly, model respectful dialogue, and build strong bridges between youth, caregivers, and peers through every spoken and unspoken interaction.",
        "learningObjectives": [
          "Master the importance of embodying the values and behaviors you wish to instill",
          "Enhance your ability to interpret non-verbal cues to better understand and respond to participants",
          "Build skills to engage with parents effectively, fostering a supportive environment for adolescents"
        ],
        "lessonOutline": "This module follows the Build→Practice→Strengthen progression across three key skills: Lead by Example (modeling consistent messaging), Non-Verbal Awareness (reading and responding to body language), and Family Partnership (engaging effectively with caregivers)."
      },
      "lessons": [
        {
          "id": "build-lead-by-example",
          "title": "Build: Lead by Example",
          "order": 1,
          "summary": "Grasp the importance of embodying the values and behaviors you wish to instill.",
          "whyItMatters": "Facilitators serve as role models, and consistency between your actions and expectations creates trust and clear boundaries for participants.",
          "strategies": [
            "Align your verbal and non-verbal communication consistently",
            "Model the respect, curiosity, and openness you want to see",
            "Be transparent about your own learning process and mistakes",
            "Demonstrate active listening and empathy in all interactions",
            "Show vulnerability appropriately to encourage participant openness"
          ],
          "resources": []
        },
        {
          "id": "practice-lead-by-example",
          "title": "Practice: Lead by Example", 
          "order": 2,
          "summary": "Demonstrate consistent messaging through actions and language in practice sessions.",
          "whyItMatters": "The gap between what we say and what we do can undermine trust and effectiveness in facilitation.",
          "strategies": [
            "Practice delivering feedback using the same tone and approach you teach",
            "Model conflict resolution skills when disagreements arise",
            "Demonstrate growth mindset by acknowledging your own learning edges",
            "Show emotional regulation techniques during challenging moments",
            "Practice transparent communication about session decisions and changes"
          ],
          "resources": []
        },
        {
          "id": "strengthen-lead-by-example",
          "title": "Strengthen: Lead by Example",
          "order": 3,
          "summary": "Maintain authenticity and clarity in communication, even under challenging circumstances.",
          "whyItMatters": "True leadership is tested in difficult moments when maintaining values and consistency becomes challenging.",
          "strategies": [
            "Stay grounded in your values when facing resistance or conflict",
            "Maintain consistent communication standards even when stressed",
            "Practice recovering gracefully from communication mistakes",
            "Model accountability by owning errors and making repairs",
            "Demonstrate resilience and learning orientation during setbacks"
          ],
          "resources": [
            {
              "label": "Encouraging Autonomy",
              "href": "/resources/encouragingautonomy.pdf",
              "type": "pdf",
              "category": "Facilitator Tips"
            },
            {
              "label": "Maintaining Authenticity",
              "href": "/resources/MaintainAuthenticity.pdf",
              "type": "pdf",
              "category": "Facilitator Tips"
            }
          ]
        },
        {
          "id": "build-nonverbal-awareness",
          "title": "Build: Non-Verbal Awareness",
          "order": 4,
          "summary": "Identify key non-verbal cues and their significance in communication.",
          "whyItMatters": "Non-verbal communication carries significant meaning and can either support or undermine your verbal messages.",
          "strategies": [
            "Learn to read facial expressions, body language, and energy levels",
            "Understand cultural differences in non-verbal communication",
            "Recognize signs of engagement, discomfort, or disengagement",
            "Notice incongruence between verbal and non-verbal messages",
            "Become aware of your own non-verbal communication patterns"
          ],
          "resources": []
        },
        {
          "id": "practice-nonverbal-awareness",
          "title": "Practice: Non-Verbal Awareness",
          "order": 5,
          "summary": "Interpret body language in varied scenarios to enhance understanding.",
          "whyItMatters": "The ability to read non-verbal cues in real-time allows facilitators to adjust their approach and respond to participant needs proactively.",
          "strategies": [
            "Practice reading group energy and individual comfort levels",
            "Identify signs of confusion, boredom, or overwhelm",
            "Notice when participants are checking out or becoming defensive",
            "Learn to distinguish between cultural differences and emotional states",
            "Practice adjusting your own non-verbal communication based on group needs"
          ],
          "resources": []
        },
        {
          "id": "strengthen-nonverbal-awareness",
          "title": "Strengthen: Non-Verbal Awareness",
          "order": 6,
          "summary": "Respond appropriately to non-verbal signals, adjusting facilitation strategies as needed.",
          "whyItMatters": "Advanced facilitators can read subtle cues and make real-time adjustments that keep groups engaged and supported.",
          "strategies": [
            "Develop intuitive awareness of group dynamics through non-verbal cues",
            "Practice making seamless adjustments based on what you observe",
            "Learn to address non-verbal concerns without calling out individuals",
            "Master the skill of checking in with participants based on body language",
            "Integrate non-verbal awareness into your overall facilitation flow"
          ],
          "resources": [
            {
              "label": "Communication Types",
              "href": "/resources/commtypes.pdf",
              "type": "pdf",
              "category": "Reference Handouts/One-Pagers"
            }
          ]
        },
        {
          "id": "build-family-partnership",
          "title": "Build: Family Partnership",
          "order": 7,
          "summary": "Understand effective communication strategies for engaging with caregivers.",
          "whyItMatters": "Strong family partnerships support participant success and create alignment between home and program environments.",
          "strategies": [
            "Learn principles of strengths-based family engagement",
            "Understand different family structures and communication preferences",
            "Practice clear, jargon-free communication about program goals",
            "Develop skills for building trust with diverse families",
            "Learn to balance youth autonomy with family involvement"
          ],
          "resources": []
        },
        {
          "id": "practice-family-partnership",
          "title": "Practice: Family Partnership",
          "order": 8,
          "summary": "Role-play conversations addressing common concerns and questions from parents.",
          "whyItMatters": "Practice builds confidence and competence in navigating the complex dynamics of family engagement.",
          "strategies": [
            "Practice explaining program benefits and addressing concerns",
            "Role-play difficult conversations about participant challenges",
            "Learn to facilitate family meetings and check-ins effectively",
            "Practice setting appropriate boundaries while maintaining partnership",
            "Develop skills for coordinating between youth and family perspectives"
          ],
          "resources": []
        },
        {
          "id": "strengthen-family-partnership",
          "title": "Strengthen: Family Partnership",
          "order": 9,
          "summary": "Navigate complex discussions with empathy and clarity, building trust with families.",
          "whyItMatters": "Advanced family partnership skills enable facilitators to work effectively with families even in challenging circumstances.",
          "strategies": [
            "Master the art of having difficult conversations with families",
            "Learn to mediate between youth and family when perspectives differ",
            "Develop skills for crisis communication with families",
            "Practice maintaining professional boundaries while building genuine relationships",
            "Create systems for ongoing family engagement and communication"
          ],
          "resources": [
            {
              "label": "Group Communication Strategies",
              "href": "/resources/groupcommstrat.pdf",
              "type": "pdf",
              "category": "Facilitator Tips"
            }
          ]
        }
      ]
    },
    {
      "id": "effective-listening",
      "title": "Effective Listening",
      "color": "#cdb483",
      "description": "Deep listening skills that create space for understanding and connection",
      "moduleIntroduction": {
        "summary": "At the heart of any strong EAP session is the ability to truly listen. Effective listening means holding space with presence and curiosity—listening not just to respond, but to understand. This competency ensures facilitators are attuned to what's said, what's unsaid, and can draw out reflection, insight, and connection through thoughtful questioning and deep listening.",
        "learningObjectives": [
          "Practice attentive listening to fully comprehend participants' perspectives",
          "Employ questions that encourage deeper discussion and reflection, promoting a more engaging learning experience"
        ],
        "lessonOutline": "This module follows the Build→Practice→Strengthen progression across two key skills: Strategies for Effective Listening and Asking Closed vs. Open Questions."
      },
      "lessons": [
        {
          "id": "build-listening-strategies",
          "title": "Build: Strategies for Effective Listening",
          "order": 1,
          "summary": "Develop foundational skills in deep listening and thoughtful questioning that create connection.",
          "whyItMatters": "Effective listening combines attentive presence with strategic questioning to help participants feel heard and guide meaningful reflection.",
          "strategies": [
            "Practice the 80/20 rule: listen 80% of the time, speak 20%",
            "Listen for emotions and needs beneath the words",
            "Use reflective listening to confirm understanding",
            "Learn the difference between open and closed questions",
            "Ask clarifying questions that deepen exploration rather than interrogate"
          ],
          "resources": []
        },
        {
          "id": "practice-listening-strategies",
          "title": "Practice: Strategies for Effective Listening",
          "order": 2,
          "summary": "Apply listening and questioning skills through role-play and real-time facilitation practice.",
          "whyItMatters": "Integrated practice builds the muscle memory needed for responsive listening and questioning even in challenging facilitation moments.",
          "strategies": [
            "Practice paraphrasing what you hear without adding your own interpretation",
            "Develop skills for listening to multiple voices in group settings",
            "Learn to ask follow-up questions that build on participant responses",
            "Practice staying curious rather than moving to solutions too quickly",
            "Connect individual insights to group learning through thoughtful questions"
          ],
          "resources": []
        },
        {
          "id": "strengthen-listening-strategies",
          "title": "Strengthen: Strategies for Effective Listening",
          "order": 3,
          "summary": "Master advanced listening and questioning techniques that transform group dynamics and deepen learning.",
          "whyItMatters": "Advanced effective listening skills enable facilitators to navigate complex emotions, resolve conflicts, and create transformative learning experiences.",
          "strategies": [
            "Use deep listening to help conflicted parties understand each other",
            "Master the art of listening with your whole presence, not just your ears",
            "Develop intuitive questioning skills that respond to group energy and needs",
            "Learn to ask questions that challenge assumptions while maintaining safety",
            "Create signature questions that consistently promote deep reflection and connection"
          ],
          "resources": [
            {
              "label": "Improve Verbal Communication",
              "href": "/resources/improveverbal.pdf",
              "type": "pdf",
              "category": "Facilitator Tips"
            }
          ]
        },
        {
          "id": "build-open-ended-questions",
          "title": "Build: Asking Closed vs. Open Questions",
          "order": 4,
          "summary": "Understand the strategic use of different question types to guide conversations and deepen learning.",
          "whyItMatters": "Knowing when to use closed versus open questions allows facilitators to control conversation flow and depth effectively.",
          "strategies": [
            "Learn the difference between closed and open-ended questions",
            "Understand when to use each type of question strategically",
            "Practice crafting open-ended questions that promote exploration",
            "Recognize how question types affect group dynamics",
            "Develop skills for using questions to guide without directing"
          ],
          "resources": []
        },
        {
          "id": "practice-open-ended-questions",
          "title": "Practice: Asking Closed vs. Open Questions",
          "order": 5,
          "summary": "Apply different questioning strategies in facilitation scenarios to achieve specific outcomes.",
          "whyItMatters": "Practice builds the intuitive ability to choose the right question type in real-time facilitation moments.",
          "strategies": [
            "Practice transitioning between closed and open questions smoothly",
            "Learn to use closed questions to focus and open questions to expand",
            "Develop skills for follow-up questions that build on responses",
            "Practice using questions to manage time and energy in sessions",
            "Learn to adapt questioning style to different participant needs"
          ],
          "resources": []
        },
        {
          "id": "strengthen-open-ended-questions",
          "title": "Strengthen: Asking Closed vs. Open Questions",
          "order": 6,
          "summary": "Master advanced questioning techniques that create transformative dialogue and deep reflection.",
          "whyItMatters": "Advanced questioning skills enable facilitators to create breakthrough moments and profound learning experiences.",
          "strategies": [
            "Develop signature questions that consistently open new possibilities",
            "Master the art of timing questions for maximum impact",
            "Learn to use questions to help groups process complex emotions",
            "Practice creating question sequences that build toward insight",
            "Develop skills for using questions to facilitate group healing"
          ],
          "resources": []
        }
      ]
    },
    {
      "id": "relationship-building",
      "title": "Relationship Building",
      "color": "#467edd",
      "description": "Creating and maintaining strong professional relationships that support learning and growth",
      "moduleIntroduction": {
        "summary": "The EAP model is built on relational trust. Facilitators are not just instructors—they are safe adults, guides, and mentors. Relationship building is a core competency that ensures group connection, emotional safety, and a sense of belonging. Facilitators create environments where youth can open up, take risks, and experience authentic community.",
        "learningObjectives": [
          "Learn techniques to create a cohesive and inclusive group atmosphere",
          "Create an environment where participants feel safe to express themselves without fear of judgment"
        ],
        "lessonOutline": "This module follows the Build→Practice→Strengthen progression across two key skills: Managing Group Dynamics and Creating Trust."
      },
      "lessons": [
        {
          "id": "build-group-dynamics",
          "title": "Build: Managing Group Dynamics",
          "order": 1,
          "summary": "Understand group behavior patterns and their influence on session outcomes.",
          "whyItMatters": "Understanding group dynamics enables facilitators to create cohesive, supportive learning environments.",
          "strategies": [
            "Learn the stages of group development and how to support each phase",
            "Understand how individual personalities affect group functioning",
            "Recognize signs of group dysfunction and know how to respond",
            "Practice creating inclusive participation structures",
            "Learn to balance individual needs with group goals"
          ],
          "resources": []
        },
        {
          "id": "practice-group-dynamics",
          "title": "Practice: Managing Group Dynamics",
          "order": 2,
          "summary": "Implement strategies to foster a cohesive and inclusive group atmosphere.",
          "whyItMatters": "Practice builds competence in reading group needs and responding with appropriate interventions.",
          "strategies": [
            "Practice interventions for common group challenges",
            "Learn to facilitate group norm-setting and agreement processes",
            "Develop skills for managing dominant and quiet participants",
            "Practice creating opportunities for authentic connection between participants",
            "Learn to use group activities that build trust and cohesion"
          ],
          "resources": []
        },
        {
          "id": "strengthen-group-dynamics",
          "title": "Strengthen: Managing Group Dynamics",
          "order": 3,
          "summary": "Navigate complex group interactions, ensuring a supportive environment for all participants.",
          "whyItMatters": "Advanced group management skills enable facilitators to support healing and growth even in challenging group dynamics.",
          "strategies": [
            "Master the ability to hold multiple perspectives simultaneously",
            "Develop skills for facilitating difficult conversations between group members",
            "Learn to use conflict as an opportunity for deeper connection and learning",
            "Practice maintaining group safety while allowing for authentic expression",
            "Develop intuitive awareness of group energy and systemic patterns"
          ],
          "resources": [
            {
              "label": "Group Communication Personas",
              "href": "/resources/commtypespersona.pdf",
              "type": "pdf",
              "category": "Reference Handouts/One-Pagers"
            },
            {
              "label": "Group Dynamics",
              "href": "/resources/groupdynamics.pdf",
              "type": "pdf",
              "category": "Reference Handouts/One-Pagers"
            },
            {
              "label": "Responsive vs. Reactive",
              "href": "/resources/responsivereactive.pdf",
              "type": "pdf",
              "category": "Facilitator Tips"
            }
          ]
        },
        {
          "id": "build-trust",
          "title": "Build: Creating Trust",
          "order": 4,
          "summary": "Learn the principles of creating a safe space for open expression.",
          "whyItMatters": "Trust is the foundation for all meaningful learning, risk-taking, and authentic participation.",
          "strategies": [
            "Understand the elements of psychological safety",
            "Learn to model vulnerability appropriately to encourage openness",
            "Practice creating clear, consistent boundaries and expectations",
            "Develop skills for acknowledging and repairing trust ruptures",
            "Learn to create physical and emotional environments that support safety"
          ],
          "resources": []
        },
        {
          "id": "practice-trust",
          "title": "Practice: Creating Trust",
          "order": 5,
          "summary": "Apply techniques that encourage vulnerability and trust among participants.",
          "whyItMatters": "Practice builds facilitator confidence in creating and maintaining trust even during challenging moments.",
          "strategies": [
            "Practice trust-building activities and debrief their effectiveness",
            "Learn to facilitate conversations about trust and safety within the group",
            "Develop skills for responding to trust violations or safety concerns",
            "Practice gradual trust-building through appropriate vulnerability progression",
            "Learn to adapt trust-building approaches for different group compositions"
          ],
          "resources": []
        },
        {
          "id": "strengthen-trust",
          "title": "Strengthen: Creating Trust",
          "order": 6,
          "summary": "Maintain an environment where participants feel secure to share and engage fully.",
          "whyItMatters": "Advanced trust-building creates lasting safe communities where participants can experience healing and transformation.",
          "strategies": [
            "Master the ability to create trust quickly with new groups",
            "Develop skills for maintaining trust even during conflict or crisis",
            "Learn to help participants build trust with each other, not just with you",
            "Practice creating brave spaces that support both safety and growth",
            "Develop systems for ongoing trust maintenance and repair"
          ],
          "resources": [
            {
              "label": "What Builds Trust",
              "href": "/resources/whatbuildstrust.pdf",
              "type": "pdf",
              "category": "Reference Handouts/One-Pagers"
            }
          ]
        }
      ]
    },
    {
      "id": "emotional-intelligence",
      "title": "Self-Reflection",
      "color": "#b1b4e5",
      "description": "Self-awareness and social awareness skills for effective facilitation",
      "moduleIntroduction": {
        "summary": "Facilitators who are self-aware and emotionally attuned can model the regulation and compassion we hope to cultivate in youth. This competency reflects a facilitator's ability to reflect, recognize emotion (in self and others), and respond in ways that support psychological safety and relational depth—hallmarks of trauma-informed care within EAP.",
        "learningObjectives": [
          "Develop self-awareness to recognize your own biases and emotions, enhancing your facilitation effectiveness",
          "Strengthen your ability to understand and share the feelings of others, building deeper connections with participants"
        ],
        "lessonOutline": "This module follows the Build→Practice→Strengthen progression across two key skills: Self-Reflection and Empathy."
      },
      "lessons": [
        {
          "id": "build-self-reflection",
          "title": "Build: Self-Reflection",
          "order": 1,
          "summary": "Develop self-awareness to recognize personal biases and emotional triggers.",
          "whyItMatters": "Self-aware facilitators can regulate their own emotions and create more stable, supportive learning environments.",
          "strategies": [
            "Practice regular self-reflection after facilitation sessions",
            "Identify your emotional triggers and early warning signs",
            "Understand your communication style and adapt to others",
            "Recognize the difference between your content and your process",
            "Seek feedback regularly and receive it with curiosity"
          ],
          "resources": []
        },
        {
          "id": "practice-self-reflection",
          "title": "Practice: Self-Reflection",
          "order": 2,
          "summary": "Engage in reflective exercises to assess and adjust facilitation approaches.",
          "whyItMatters": "Regular practice builds the habit of self-awareness that supports continuous improvement.",
          "strategies": [
            "Practice structured reflection using guided questions",
            "Learn to identify patterns in your facilitation challenges and successes",
            "Develop skills for in-the-moment self-awareness during sessions",
            "Practice receiving and integrating feedback from participants and colleagues",
            "Learn to separate your personal triggers from group needs"
          ],
          "resources": []
        },
        {
          "id": "strengthen-self-reflection",
          "title": "Strengthen: Self-Reflection",
          "order": 3,
          "summary": "Continuously evaluate and refine facilitation practices to enhance effectiveness.",
          "whyItMatters": "Advanced self-reflection creates facilitators who model lifelong learning and vulnerability as strength.",
          "strategies": [
            "Develop sophisticated self-monitoring skills during facilitation",
            "Learn to use self-reflection to innovate and improve your practice",
            "Master the ability to model self-reflection for participants",
            "Practice using self-awareness to navigate complex ethical situations",
            "Develop systems for ongoing professional development and growth"
          ],
          "resources": [
            {
              "label": "Mirror Moments Map",
              "href": "/resources/mirrormomentsmap.pdf",
              "type": "pdf",
              "category": "Planning Tools"
            },
            {
              "label": "Fatal Attribution Error – Part 1",
              "href": "/resources/FAE.pdf",
              "type": "pdf",
              "category": "Reference Handouts/One-Pagers"
            },
            {
              "label": "Fatal Attribution Error – Part 2",
              "href": "/resources/FAE2.pdf",
              "type": "pdf",
              "category": "Reference Handouts/One-Pagers"
            }
          ]
        }
      ]
    },
    {
      "id": "equity-inclusion",
      "title": "Equity & Inclusion",
      "color": "#cdb483",
      "description": "Creating inclusive environments where all participants can thrive and contribute",
      "moduleIntroduction": {
        "summary": "At EAP, every participant must feel seen, valued, and included. This competency ensures facilitators can recognize implicit bias, foster equitable engagement, and intentionally include those on the margins. Facilitators who lead with equity expand access to safety, voice, and belonging - foundations of a just learning space.",
        "learningObjectives": [
          "Identify and address personal biases to ensure fair and inclusive facilitation",
          "Recognize and support participants who may feel marginalized, ensuring everyone's voice is heard"
        ],
        "lessonOutline": "This module follows the Build→Practice→Strengthen progression across two key skills: Bias Awareness and Inclusion Scanning."
      },
      "lessons": [
        {
          "id": "build-bias-awareness",
          "title": "Build: Bias Awareness",
          "order": 1,
          "summary": "Identify personal biases and understand their impact on facilitation.",
          "whyItMatters": "Unconscious bias can create barriers to inclusion and limit the effectiveness of facilitation for all participants.",
          "strategies": [
            "Learn about different types of bias and how they operate",
            "Practice self-assessment tools to identify your own biases",
            "Understand how bias affects perception, decision-making, and behavior",
            "Learn about systemic and structural forms of bias in organizations",
            "Develop awareness of bias in facilitation practices and content"
          ],
          "resources": []
        },
        {
          "id": "practice-bias-awareness",
          "title": "Practice: Bias Awareness",
          "order": 2,
          "summary": "Implement strategies to mitigate biases during sessions.",
          "whyItMatters": "Practice builds the skill to recognize and interrupt bias in real-time during facilitation.",
          "strategies": [
            "Practice bias interruption techniques in simulated scenarios",
            "Learn to notice bias in group dynamics and participation patterns",
            "Develop skills for addressing bias when it arises in groups",
            "Practice creating bias-aware facilitation plans and activities",
            "Learn to use bias awareness to improve decision-making processes"
          ],
          "resources": []
        },
        {
          "id": "strengthen-bias-awareness",
          "title": "Strengthen: Bias Awareness",
          "order": 3,
          "summary": "Foster an inclusive environment that actively challenges and reduces bias.",
          "whyItMatters": "Advanced bias awareness creates facilitators who can model inclusive leadership and create equitable learning environments.",
          "strategies": [
            "Master the ability to facilitate difficult conversations about bias and privilege",
            "Develop skills for creating systems that prevent bias from operating",
            "Learn to help groups develop collective awareness of bias and inclusion",
            "Practice modeling accountability when you make bias-related mistakes",
            "Develop organizational strategies for addressing systemic bias"
          ],
          "resources": [
            {
              "label": "Habits to Adopt",
              "href": "/resources/HabitstoAdopt.pdf",
              "type": "pdf",
              "category": "Action Tools"
            },
            {
              "label": "Types of Bias",
              "href": "/resources/TypesofBias.pdf",
              "type": "pdf",
              "category": "Reference Materials"
            },
            {
              "label": "Bias Interruption",
              "href": "/resources/BiasInterruption.pdf",
              "type": "pdf",
              "category": "Scenarios in Action"
            }
          ]
        },
        {
          "id": "build-inclusion-scanning",
          "title": "Build: Inclusion Scanning",
          "order": 4,
          "summary": "Recognize signs of participant disengagement or marginalization.",
          "whyItMatters": "Early recognition of exclusion allows facilitators to intervene before participants disconnect or withdraw.",
          "strategies": [
            "Learn to identify signs of disengagement, marginalization, or exclusion",
            "Understand how different identities may experience exclusion differently",
            "Practice environmental scanning for inclusion and participation",
            "Develop skills for noticing who is not speaking or participating",
            "Learn to recognize microaggressions and their impact on group dynamics"
          ],
          "resources": []
        },
        {
          "id": "practice-inclusion-scanning",
          "title": "Practice: Inclusion Scanning",
          "order": 5,
          "summary": "Develop approaches to re-engage and support outlier participants.",
          "whyItMatters": "Practice builds the skills needed to respond effectively when exclusion is identified.",
          "strategies": [
            "Practice intervention strategies for different types of exclusion",
            "Learn to re-engage participants without calling them out inappropriately",
            "Develop skills for creating multiple pathways for participation",
            "Practice adjusting activities in real-time to increase inclusion",
            "Learn to use inclusion scanning to inform facilitation decisions"
          ],
          "resources": []
        },
        {
          "id": "strengthen-inclusion-scanning",
          "title": "Strengthen: Inclusion Scanning",
          "order": 6,
          "summary": "Ensure all participants feel valued and included throughout sessions.",
          "whyItMatters": "Advanced inclusion scanning creates facilitators who can proactively design and maintain equitable learning environments.",
          "strategies": [
            "Master the ability to design inherently inclusive activities and processes",
            "Develop skills for creating cultures where participants support each other's inclusion",
            "Learn to use inclusion scanning to continuously improve your practice",
            "Practice helping groups develop their own inclusion awareness and skills",
            "Develop systems for maintaining inclusion across multiple sessions and programs"
          ],
          "resources": [
            {
              "label": "Habits to Adopt",
              "href": "/resources/HabitstoAdopt.pdf",
              "type": "pdf",
              "category": "Planning Tools"
            },
            {
              "label": "Inclusive Planning",
              "href": "/resources/InclusivePlanning.pdf",
              "type": "pdf",
              "category": "Planning Tools"
            },
            {
              "label": "Inclusion Scanning",
              "href": "/resources/InclusionScanning.pdf",
              "type": "pdf",
              "category": "Reference Materials"
            }
          ]
        }
      ]
    },
    {
      "id": "wrap-up",
      "title": "Program Wrap-Up",
      "color": "#cdb483",
      "description": "Integration of learning and planning for future growth and development",
      "lessons": [
        {
          "id": "integration-reflection",
          "title": "Integration & Future Planning",
          "order": 1,
          "summary": "Synthesize learning from all competency areas and create plans for ongoing development.",
          "whyItMatters": "Integration ensures that discrete skills become part of a cohesive facilitation practice and supports lifelong learning.",
          "strategies": [
            "Reflect on growth across all six competency areas",
            "Identify strengths to build upon and areas for continued development",
            "Create a personal development plan for ongoing skill building",
            "Build a support network for ongoing learning and accountability",
            "Practice articulating your facilitation philosophy and approach"
          ],
          "resources": [
            {
              "label": "Competency Integration Reflection Tool",
              "href": "/resources/integration-reflection.pdf",
              "type": "pdf",
              "category": "Planning Tools"
            },
            {
              "label": "Personal Development Planning Guide",
              "href": "/resources/development-plan.pdf",
              "type": "pdf",
              "category": "Planning Tools"
            },
            {
              "label": "Support Network Building Guide",
              "href": "/resources/support-network.pdf",
              "type": "pdf",
              "category": "Planning Tools"
            }
          ]
        }
      ]
    }
  ]
}