{
  "version": "1.0.0",
  "lastUpdated": "2025-01-22",
  "title": "EAP Facilitator Development Program - Sample",
  "description": "A sample demonstration of the EAP facilitator training platform",
  "sections": [
    {
      "id": "leadership",
      "title": "Leadership",
      "color": "#467edd", 
      "description": "Developing leadership skills for effective facilitation and team management",
      "moduleIntroduction": {
        "summary": "Leadership in the Elevate Adolescence Program is about setting the tone, modeling integrity, and guiding with responsiveness. As a facilitator, your leadership shapes how safe, engaged, and empowered participants feel in your group.\n\nThis sample module demonstrates our Build→Practice→Strengthen approach to skill development.",
        "learningObjectives": [
          "Learn to deliver constructive and timely feedback that encourages growth and development",
          "Develop the ability to make swift, effective decisions that keep sessions responsive to participants' needs"
        ],
        "lessonOutline": "This sample module shows the Build→Practice progression for Providing Feedback."
      },
      "lessons": [
        {
          "id": "build-feedback",
          "title": "Build: Providing Feedback",
          "order": 1,
          "summary": "Understand the principles of constructive feedback and its role in adolescent development.",
          "whyItMatters": "Effective feedback drives growth, builds trust, and creates psychological safety in learning environments.",
          "strategies": [
            "Use the SBI (Situation-Behavior-Impact) feedback model",
            "Practice the Feedback Planning Tool for difficult conversations",
            "Focus on specific behaviors rather than personality traits",
            "Invite reflection and dialogue rather than one-way delivery"
          ],
          "resources": [
            {
              "label": "Types of Feedback",
              "href": "/resources/typesoffeedback.pdf",
              "type": "pdf",
              "category": "Reference Handouts/One-Pagers"
            }
          ]
        },
        {
          "id": "practice-feedback",
          "title": "Practice: Providing Feedback",
          "order": 2,
          "summary": "Deliver feedback in simulated sessions, focusing on clarity and encouragement.",
          "whyItMatters": "Practice builds confidence and competence in delivering feedback that promotes growth rather than defensiveness.",
          "strategies": [
            "Practice giving both corrective and affirming feedback",
            "Learn to time feedback appropriately for maximum impact",
            "Develop skills for delivering feedback to diverse learning styles",
            "Practice creating action steps that participants can implement"
          ],
          "resources": [
            {
              "label": "Feedback Planning Tool",
              "href": "/resources/feedbackplanningtool.pdf",
              "type": "pdf",
              "category": "Planning Tools"
            }
          ]
        }
      ]
    },
    {
      "id": "communication",
      "title": "Communication",
      "color": "#b1b4e5",
      "description": "Advanced communication skills for facilitating meaningful dialogue and connection",
      "moduleIntroduction": {
        "summary": "Facilitators serve as role models in both verbal and non-verbal communication. Within EAP spaces, communication is more than delivering content—it's how we show consistency, clarity, and care.\n\nThis sample module demonstrates our comprehensive approach to communication skill development.",
        "learningObjectives": [
          "Master the importance of embodying the values and behaviors you wish to instill",
          "Enhance your ability to interpret non-verbal cues to better understand and respond to participants"
        ],
        "lessonOutline": "This sample module shows our approach to Lead by Example communication."
      },
      "lessons": [
        {
          "id": "build-lead-by-example",
          "title": "Build: Lead by Example",
          "order": 1,
          "summary": "Grasp the importance of embodying the values and behaviors you wish to instill.",
          "whyItMatters": "Facilitators serve as role models, and consistency between your actions and expectations creates trust and clear boundaries for participants.",
          "strategies": [
            "Align your verbal and non-verbal communication consistently",
            "Model the respect, curiosity, and openness you want to see",
            "Be transparent about your own learning process and mistakes",
            "Demonstrate active listening and empathy in all interactions"
          ],
          "resources": [
            {
              "label": "Maintaining Authenticity",
              "href": "/resources/MaintainAuthenticity.pdf",
              "type": "pdf",
              "category": "Facilitator Tips"
            }
          ]
        }
      ]
    }
  ]
}